Revit 2018 API
ConicalSurface Methods
The ConicalSurface type exposes the following members.
Methods
Name | Description
Create
 Creates a conical surface defined by a local reference frame and a half angle.
Dispose |  (Inherited from Surface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFrameOfReference
 Returns frame of reference associated with this ConicalSurface.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidConeAngle
 Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace